README.org
#+TITLE: Dr. Eccentric's Emacs Literate Config
#+AUTHOR: Dr. Eccentric
#+DESCRICPTION: Eccentric's Personal Emacs Config.
#+STARTUP: indent
#+PROPERTY: header-args:emacs-lisp :tangle ./init.el :mkdirp yes
#+OPTIONS: toc:

* TABLE OF CONTENTS :toc:
- [[#elpaca][Elpaca]]
- [[#init-file-wrapper][Init File wrapper]]
- [[#initel-creation-zone][Init.el Creation Zone]]
  - [[#auto-tangle-configuration-files][Auto-tangle Configuration Files]]
  - [[#configure-babel-languages][Configure Babel Languages]]
- [[#cache][Cache]]
- [[#backup][Backup]]
- [[#personal-details][PERSONAL DETAILS]]
- [[#user-interface-customization][USER-INTERFACE CUSTOMIZATION]]
  - [[#basic-ui-configuration][Basic UI Configuration]]
  - [[#fonts][Fonts]]
  - [[#dashboard][Dashboard]]
  - [[#theme][Theme]]
  - [[#mode-line][MODE-LINE]]
  - [[#rainbow-delimiter][RAINBOW DELIMITER]]
  - [[#which-key][WHICH-Key]]
  - [[#butler-for-the-buffer][BUTLER FOR THE BUFFER]]
  - [[#idea-smart-parens][IDEA SMART PARENS]]
  - [[#all-the-icons][ALL THE ICONS]]
- [[#modal-editing][Modal Editing]]
  - [[#meow][Meow]]
  - [[#evil][EVIL]]
- [[#fail-safe][Fail Safe]]
- [[#idea-dired][IDEA Dired]]
- [[#neo-tree][NEO-TREE]]
- [[#keybindings][Keybindings]]
  - [[#general][GENERAL]]
  - [[#idea-table][IDEA table]]
- [[#predicting-layers][Predicting layers]]
  - [[#vertico][VERTICO]]
  - [[#ivy][Ivy]]
  - [[#marginaila][MARGINAILA]]
  - [[#orderless][ORDERLESS]]
  - [[#consule][CONSULE]]
  - [[#history][History]]
  - [[#company][Company]]
  - [[#fuzzy-search][Fuzzy Search]]
  - [[#language-tool][Language-tool]]
- [[#bibletex][Bibletex]]
  - [[#citar][CITAR]]
  - [[#org-ref][ORG-REF]]
  - [[#org-bibletex][ORG-BIBLETEX]]
  - [[#filing-system][Filing System]]
- [[#r-setup][R setup]]
- [[#worg-microsome][wORG Microsome]]
  - [[#org-beautification][Org Beautification]]
  - [[#sticky-headers][Sticky Headers]]
  - [[#org-remark][ORG-REMARK]]
  - [[#org-tempo--short-hand][ORG-TEMPO | SHORT HAND]]
  - [[#directory-yellow-pages][Directory (Yellow Pages)]]
  - [[#idea-org-sidebar][IDEA Org-Sidebar]]
  - [[#super-bullets][Super bullets]]
  - [[#enabling-of-toc-to-all-org-documents][ENABLING OF TOC TO ALL ORG DOCUMENTS:]]
  - [[#olivetti][Olivetti]]
  - [[#interleaving][Interleaving]]
  - [[#org-presentation][ORG-Presentation]]
  - [[#templates][TEMPLATES]]
- [[#org-roam][ORG-ROAM]]
  - [[#installation][Installation]]
  - [[#idea-emacs-sql][IDEA EMACS-sql]]
  - [[#org-roam-ui][ORG-ROAM-UI]]
  - [[#caching][Caching]]
- [[#plan-org-agenda][PLAN ORG-AGENDA]]
  - [[#keywords][KEYWORDS]]
  - [[#org-reoccurer][ORG-REOCCURER]]
  - [[#re-file][RE: file]]
  - [[#ui-improvement][UI Improvement]]
  - [[#org-caldav][ORG-CalDAv]]
- [[#org-journal][ORG-JOURNAL]]
- [[#idea-rss][IDEA RSS]]
- [[#vterm][Vterm]]
- [[#custom-configuration][Custom Configuration]]

* Elpaca
#+begin_src emacs-lisp
;; -*- lexical-binding: t; -*-

  ;; The loading of the Vibraniums
        (add-to-list 'load-path "~/.config/emacs/vibraniums/")
        ;; The Elpaca Package Manager
        (require 'elpaca-setup)
#+end_src
* Init File wrapper
#+begin_src emacs-lisp
(let ((file-name-handler-alist nil)) "~/.config/emacs/init.el")
#+end_src

* Init.el Creation Zone
** Auto-tangle Configuration Files
This snippet adds a hook to =org-mode= buffers so that =dr/org-babel-tangle-config= gets executed each time such a buffer gets saved.  This function checks to see if the file being saved is the Emacs.org file you're looking at right now, and if so, automatically exports the configuration here to the associated output files.
#+begin_src emacs-lisp
  ;; Automatically tangle our config.org config file when we save it
  (defun dr/org-babel-tangle-config ()
    (when (string-equal (buffer-file-name)
                        (expand-file-name "~/.config/emacs/README.org"))
      ;; Dynamic scoping to the rescue
      (let ((org-confirm-babel-evaluate nil))
        (org-babel-tangle))))

  (add-hook 'org-mode-hook (lambda () (add-hook 'after-save-hook #'dr/org-babel-tangle-config)))
#+end_src


** Configure Babel Languages
To execute or export code in =org-mode= code blocks, you'll need to set up =org-babel-load-languages= for each language you'd like to use.
#+begin_src emacs-lisp
    (org-babel-do-load-languages
      'org-babel-load-languages
      '((emacs-lisp . t)
        (python . t)
        (R . t)))
    (push '("conf-unix" . conf-unix) org-src-lang-modes)
#+end_src

* Cache
#+begin_src emacs-lisp
(add-to-list 'native-comp-eln-load-path (expand-file-name "eln-cache/" user-emacs-directory))
#+end_src

* Backup
#+begin_src emacs-lisp
(setq backup-directory-alist '((".*" . "~/.config/emacs/.trash")))
#+end_src

* PERSONAL DETAILS
#+begin_src emacs-lisp
(setq user-full-name "Ivan Pereira"
      user-mail-address "ivan.pereira@mailfence.com")
#+end_src

* USER-INTERFACE CUSTOMIZATION
** Basic UI Configuration
This section configures basic UI settings that remove unneeded elements to make Emacs look a lot more minimal and modern.
#+begin_src emacs-lisp 
    ;; Disable line numbers for some modes
     (dolist (mode '(
                    term-mode-hook
                    shell-mode-hook
                    treemacs-mode-hook
                    eshell-mode-hook))
      (add-hook mode (lambda () (display-line-numbers-mode 0))))
#+end_src

** Fonts
#+begin_src emacs-lisp
    ;; Set the default font
    (set-face-attribute 'default nil
		     :font "Input Sans"
		     :height 180
		     :weight 'medium)
   (set-face-attribute 'variable-pitch nil
    :font "Input Sans"
    :height 180
    :weight 'medium)
    (set-face-attribute 'fixed-pitch nil
    :font "Input Mono"
    :height 180
    :weight 'medium)
  ;; Makes commented text and keywords italics.
  ;; This is working in emacsclient but not emacs.
  ;; Your font must have an italic face available.
  (set-face-attribute 'font-lock-comment-face nil
    :slant 'italic)
  (set-face-attribute 'font-lock-keyword-face nil
    :slant 'italic)

  ;; This sets the default font on all graphical frames created after restarting Emacs.
  ;; Does the same thing as 'set-face-attribute default' above, but emacsclient fonts
  ;; are not right unless I also add this method of setting the default font.
  ;;(add-to-list 'default-frame-alist '(font . "Input Mono-11"))

  ;; Uncomment the following line if line spacing needs adjusting.
;  (setq-default line-spacing 0.12)

    ;; Enable line numbers
    (global-display-line-numbers-mode t)

  (use-package nerd-icons
  ;; :custom
  ;; The Nerd Font you want to use in GUI
  ;; "Symbols Nerd Font Mono" is the default and is recommended
  ;; but you can use any other Nerd Font if you want
  ;; (nerd-icons-font-family "Symbols Nerd Font Mono")
  )
#+end_src

** Dashboard
#+begin_src emacs-lisp
           (use-package dashboard
            :config
            (dashboard-setup-startup-hook)
          (setq initial-buffer-choice (lambda () (get-buffer-create "*dashboard*"))))
        ;; Set the title
        (setq dashboard-banner-logo-title "Welcome to Forgers Board")
        ;; Set the banner
  ;;    (setq dashboard-startup-banner 'logo)
        (setq dashboard-startup-banner "/home/Dr.Eccentric/Pictures/DP/CosmoDoc-modified.png")
        ;; Value can be
        ;; - nil to display no banner
        ;; - 'official which displays the official emacs logo
        ;; - 'logo which displays an alternative emacs logo
        ;; - 1, 2 or 3 which displays one of the text banners
        ;; - "path/to/your/image.gif", "path/to/your/image.png" or "path/to/your/text.txt" which displays whatever gif/image/text you would prefer
        ;; - a cons of '("path/to/your/image.png" . "path/to/your/text.txt")

        ;; Content is not centered by default. To center, set
        (setq dashboard-center-content t)

        ;; To disable shortcut "jump" indicators for each section, set
        (setq dashboard-show-shortcuts t)
    (setq dashboard-display-icons-p t) ;; display icons on both GUI and terminal
    (setq dashboard-icon-type 'nerd-icons) ;; use `nerd-icons' package
#+end_src
 
** Theme
+ I need to find out why this not considered to be not safe
  - What is the reason
#+begin_src emacs-lisp
	(use-package ef-themes
          :demand t
          :config
           (load-theme 'ef-elea-dark :no-confirm))
#+end_src
- Pitch / Size Themeing
#+begin_src emacs-lisp :tangle no
    (setq ef-themes-headings ; read the manual's entry or the doc string
	  '((0 variable-pitch light 1.9)
	    (1 variable-pitch light 1.8)
	    (2 variable-pitch regular 1.7)
	    (3 variable-pitch regular 1.6)
	    (4 variable-pitch regular 1.5)
	    (5 variable-pitch 1.4) ; absence of weight means `bold'
	    (6 variable-pitch 1.3)
	    (7 variable-pitch 1.2)
	    (t variable-pitch 1.1)))
  (setq ef-themes-mixed-fonts t
	ef-themes-variable-pitch-ui t)
;; Disable all other themes to avoid awkward blending:
(mapc #'disable-theme custom-enabled-themes)
#+end_src

** MODE-LINE
#+begin_src emacs-lisp
  (use-package doom-modeline
    :demand t
 :init (doom-modeline-mode 1)
  :custom ((doom-modeline-height 30)))
#+end_src

** RAINBOW DELIMITER
#+begin_src emacs-lisp
  (use-package rainbow-delimiters
    :hook (prog-mode . rainbow-delimiters-mode))
#+end_src

** WHICH-Key
#+begin_src emacs-lisp
(use-package which-key
    :init (which-key-mode)
    :diminish which-key-mode
    :config
    (setq which-key-idle-delay 1))
#+end_src
** BUTLER FOR THE BUFFER
#+begin_src emacs-lisp :tangle no
  (use-package bufler
    :elpaca (bufler :fetcher github :repo "alphapapa/bufler.el"
                    :files (:defaults (:exclude "helm-bufler.el"))))
#+end_src

** IDEA SMART PARENS
#+begin_src emacs-lisp
      (use-package smartparens-config
      :elpaca (smartpares-config :host github :repo "Fuco1/smartparens")
      :config
     (smartparens-global-mode t)
     ;; Customize smartparens behavior for ~
(sp-pair "~" "~" :trigger "~"))
#+end_src

** ALL THE ICONS
#+begin_src emacs-lisp
(use-package all-the-icons
  :ensure t
  :if (display-graphic-p))
#+end_src

* Modal Editing
** Meow
#+begin_src emacs-lisp :tangle no
    (use-package meow
      :ensure t
      :config
      (require 'meow-iridium)
      (meow-setup)
      (meow-global-mode 1)
  )
#+end_src
** EVIL
#+begin_src emacs-lisp
      (use-package evil
        :ensure t
        :init
          (setq evil-want-integration t)
          (setq evil-want-keybinding nil)
          (evil-mode 1))
#+end_src

*** EVIL ORG
#+begin_src emacs-lisp
(use-package evil-org
  :ensure t
  :after org
  :hook (org-mode . (lambda () evil-org-mode))
  :config
  (require 'evil-org-agenda)
  (evil-org-agenda-set-keys)) 
#+end_src
*** EVIL COLLECTIONS
#+begin_src emacs-lisp
(use-package evil-collection
  :after (evil)
  :config
  (evil-collection-init))
#+end_src
*** EVIIL Tutor
#+begin_src emacs-lisp
(use-package evil-tutor)
#+end_src

