init.el
;; -*- lexical-binding: t; -*-

  ;; The loading of the Vibraniums
        (add-to-list 'load-path "~/.config/emacs/vibraniums/")
        ;; The Elpaca Package Manager
        (require 'elpaca-setup)

(let ((file-name-handler-alist nil)) "~/.config/emacs/init.el")

;; Automatically tangle our config.org config file when we save it
(defun dr/org-babel-tangle-config ()
  (when (string-equal (buffer-file-name)
                      (expand-file-name "~/.config/emacs/README.org"))
    ;; Dynamic scoping to the rescue
    (let ((org-confirm-babel-evaluate nil))
      (org-babel-tangle))))

(add-hook 'org-mode-hook (lambda () (add-hook 'after-save-hook #'dr/org-babel-tangle-config)))

(org-babel-do-load-languages
  'org-babel-load-languages
  '((emacs-lisp . t)
    (python . t)
    (R . t)))
(push '("conf-unix" . conf-unix) org-src-lang-modes)

(add-to-list 'native-comp-eln-load-path (expand-file-name "eln-cache/" user-emacs-directory))

(setq backup-directory-alist '((".*" . "~/.config/emacs/.trash")))

(setq user-full-name "Ivan Pereira"
      user-mail-address "ivan.pereira@mailfence.com")

;; Disable line numbers for some modes
 (dolist (mode '(
                term-mode-hook
                shell-mode-hook
                treemacs-mode-hook
                eshell-mode-hook))
  (add-hook mode (lambda () (display-line-numbers-mode 0))))

;; Set the default font
    (set-face-attribute 'default nil
		     :font "Input Sans"
		     :height 180
		     :weight 'medium)
   (set-face-attribute 'variable-pitch nil
    :font "Input Sans"
    :height 180
    :weight 'medium)
    (set-face-attribute 'fixed-pitch nil
    :font "Input Mono"
    :height 180
    :weight 'medium)
  ;; Makes commented text and keywords italics.
  ;; This is working in emacsclient but not emacs.
  ;; Your font must have an italic face available.
  (set-face-attribute 'font-lock-comment-face nil
    :slant 'italic)
  (set-face-attribute 'font-lock-keyword-face nil
    :slant 'italic)

  ;; This sets the default font on all graphical frames created after restarting Emacs.
  ;; Does the same thing as 'set-face-attribute default' above, but emacsclient fonts
  ;; are not right unless I also add this method of setting the default font.
  ;;(add-to-list 'default-frame-alist '(font . "Input Mono-11"))

  ;; Uncomment the following line if line spacing needs adjusting.
;  (setq-default line-spacing 0.12)

    ;; Enable line numbers
    (global-display-line-numbers-mode t)

  (use-package nerd-icons
  ;; :custom
  ;; The Nerd Font you want to use in GUI
  ;; "Symbols Nerd Font Mono" is the default and is recommended
  ;; but you can use any other Nerd Font if you want
  ;; (nerd-icons-font-family "Symbols Nerd Font Mono")
  )

(use-package dashboard
          :config
          (dashboard-setup-startup-hook)
        (setq initial-buffer-choice (lambda () (get-buffer-create "*dashboard*"))))
      ;; Set the title
      (setq dashboard-banner-logo-title "Welcome to Forgers Board")
      ;; Set the banner
;;    (setq dashboard-startup-banner 'logo)
      (setq dashboard-startup-banner "/home/Dr.Eccentric/Pictures/DP/CosmoDoc-modified.png")
      ;; Value can be
      ;; - nil to display no banner
      ;; - 'official which displays the official emacs logo
      ;; - 'logo which displays an alternative emacs logo
      ;; - 1, 2 or 3 which displays one of the text banners
      ;; - "path/to/your/image.gif", "path/to/your/image.png" or "path/to/your/text.txt" which displays whatever gif/image/text you would prefer
      ;; - a cons of '("path/to/your/image.png" . "path/to/your/text.txt")

      ;; Content is not centered by default. To center, set
      (setq dashboard-center-content t)

      ;; To disable shortcut "jump" indicators for each section, set
      (setq dashboard-show-shortcuts t)
  (setq dashboard-display-icons-p t) ;; display icons on both GUI and terminal
  (setq dashboard-icon-type 'nerd-icons) ;; use `nerd-icons' package

(use-package ef-themes
  :demand t
  :config
   (load-theme 'ef-elea-dark :no-confirm))

(use-package doom-modeline
   :demand t
:init (doom-modeline-mode 1)
 :custom ((doom-modeline-height 30)))

(use-package rainbow-delimiters
  :hook (prog-mode . rainbow-delimiters-mode))

(use-package which-key
    :init (which-key-mode)
    :diminish which-key-mode
    :config
    (setq which-key-idle-delay 1))

(use-package smartparens-config
      :elpaca (smartpares-config :host github :repo "Fuco1/smartparens")
      :config
     (smartparens-global-mode t)
     ;; Customize smartparens behavior for ~
(sp-pair "~" "~" :trigger "~"))

(use-package all-the-icons
  :ensure t
  :if (display-graphic-p))

(use-package evil
  :ensure t
  :init
    (setq evil-want-integration t)
    (setq evil-want-keybinding nil)
    (evil-mode 1))

(use-package evil-org
  :ensure t
  :after org
  :hook (org-mode . (lambda () evil-org-mode))
  :config
  (require 'evil-org-agenda)
  (evil-org-agenda-set-keys))

(use-package evil-collection
  :after (evil)
  :config
  (evil-collection-init))

(use-package evil-tutor)
