README.org
* Fail Safe
1. Restart
#+begin_src emacs-lisp
              (use-package restart-emacs
          :demand t
              :elpaca (restart-emacs :host github :repo "iqbalansari/restart-emacs")
          :config
          (setq restart-emacs-restore-frame t)
          :bind
  ("C-c r r" . restart-emacs))
#+end_src
2. Reload
#+begin_src emacs-lisp 
    (defun my-reload-emacs ()
      "Reload Emacs by re-evaluating the init file."
      (interactive)
      (load-file user-init-file))
  
  (global-set-key (kbd "C-c s") 'my-reload-emacs)
#+end_src

3. config
#+begin_src emacs-lisp
(global-set-key (kbd "C-c f e") 'open-my-config)

(defun open-my-config ()
  "Open README.org ."
  (interactive)
  (find-file "~/.config/emacs/README.org"))
#+end_src

* IDEA Dired
#+begin_src emacs-lisp  
(use-package all-the-icons-dired
  :hook (dired-mode . (lambda () (all-the-icons-dired-mode t))))

(use-package dired-open
  :config
  ;; Doesn't work as expected!
  ;;(add-to-list 'dired-open-functions #'dired-open-xdg t)
  (setq dired-open-extensions '(("png" . "feh")
                                ("mkv" . "mpv"))))
#+end_src

* NEO-TREE
#+begin_src emacs-lisp
      (use-package neotree
        :ensure t
        :config
        (setq neo-theme (if (display-graphic-p) 'icons 'arrow))
)
#+end_src

* Keybindings
** GENERAL
#+begin_src emacs-lisp
   (use-package general
     :config
     (general-evil-setup)
      (general-create-definer leader-key
          :states '(normal insert visual emacs)
          :keymaps 'override
          :prefix "SPC" ;; set leader
          :global-prefix "C-SPC");; access leader in insert mode
  (require 'hashmap)
   )
#+end_src

** IDEA table
| Key      | Function                 |
|----------+--------------------------|
| h        | evil-forward-char        |
| e        | evil-backward-char       |
| o        | evil-previous-line       |
| n        | evil-next-line           |
| ...      | ...                      |

#+begin_src emacs-lisp

#+end_src

* Predicting layers
** VERTICO
#+begin_src emacs-lisp
    (use-package vertico
  :custom
  (vertico-cycle t)
    :config
  (vertico-mode 1))
#+end_src
- you can also use [[https://www.youtube.com/live/11CO1vCpfrs?feature=share&t=4172]["vertico-extension/postframe"]] for having afloting menu =:M-x=
** TODO Ivy
#+begin_src emacs-lisp 
(use-package ivy
  :ensure t)
 ; :config
 ; (ivy-mode 1))

(use-package ivy-rich
  :ensure t
  :config
  (ivy-rich-mode 1))

(use-package all-the-icons-ivy-rich
  :config
  (all-the-icons-ivy-rich-mode 1))

#+end_src
** MARGINAILA
#+begin_src emacs-lisp
	(use-package marginalia
  :custom
  (marginalia-annotators '(marginalia-annotators-heavy marginalia-annotators-light nil))
  :init
  (marginalia-mode))
#+end_src

** ORDERLESS
#+begin_src emacs-lisp
      (use-package orderless
  :init
  ;; Tune the global completion style settings to your liking!
  ;; This affects the minibuffer and non-lsp completion at point.
  (setq completion-styles '(orderless partial-completion basic)
        completion-category-defaults nil
        completion-category-overrides nil))
#+end_src

** CONSULE
#+begin_src emacs-lisp
  (use-package counsel
    :bind (
          ;("M-x" . counsel-M-x)
           ("C-x b" . counsel-switch-buffer)
           ("C-x C-f" . counsel-find-file)
           :map minibuffer-local-map
           ("M-r" . 'counsel-minibuffer-history)))
#+end_src

#+RESULTS:

** History
#+begin_src emacs-lisp
  (setq savehist-mode t)
#+end_src

** Company
#+begin_src emacs-lisp
  (use-package company
    :config
    (global-company-mode))
#+end_src

** Fuzzy Search
#+begin_src emacs-lisp 
(use-package fuzzy)
#+end_src

** Language-tool
#+begin_src emacs-lisp
        (use-package langtool
          :elpaca (langtool :host github :repo "mhayashi1120/Emacs-langtool")
          :init
          (setq langtool-language-tool-jar "~/.config/emacs/LanguageTool/languagetool-commandline.jar")
          (setq langtool-default-language "en-GB"))
#+end_src

* TODO Bibletex
this can be achived with the HELM & IVY Package
#+begin_src emacs-lisp
    (use-package ivy-bibtex
    :ensure t
    :config
    (setq bibtex-completion-bibliography '("~/Documents/Articles/bibliotext/dummy.bib")) ; Add the path to your .bib file
    (setq bibtex-completion-library-path '("~/Documents/Articles/Medicine") ) ; Add the path to your PDFs or attach files
    (setq bibtex-completion-notes-path "~/Documents/wORG/Org-ROAM/Alexandria/") ; Add the path to your notes directory

    ;; Use Ivy for BibTeX selection
    (setq bibtex-completion-cite-prompt-for-optional-arguments nil)
    (ivy-bibtex-ivify-action ivy-bibtex-open-external ivy-bibtex)
    (setq bibtex-completion-additional-search-fields '(keywords))
    (setq bibtex-completion-notes-template-multiple-files
          (concat
          "#+TITLE: ${title}\n"
          "#+ROAM_KEY: cite:${=key=}\n"))
    )

  ;; Set a keybinding for Ivy BibTeX
;  (global-set-key (kbd "C-c C-b") 'ivy-bibtex)

#+end_src

** CITAR
#+begin_src emacs-lisp 
(use-package citar
  :custom
  (org-cite-global-bibliography '("~/bib/references.bib"))
  (org-cite-insert-processor 'citar)
  (org-cite-follow-processor 'citar)
  (org-cite-activate-processor 'citar)
  (citar-bibliography org-cite-global-bibliography)
  ;; optional: org-cite-insert is also bound to C-c C-x C-@
  :bind
  (:map org-mode-map :package org ("C-c b" . #'org-cite-insert)))
  
    (use-package citar-org-roam
    :after (citar org-roam)
    :config (citar-org-roam-mode))
#+end_src

** ORG-REF
#+begin_src emacs-lisp
(use-package org-ref
  :ensure t
  :config
  ;; Customize your Org-Ref settings here
  )
#+end_src

** ORG-BIBLETEX
#+begin_src emacs-lisp :tangle no
(use-package org-roam-bibtex
  :ensure t
  :config
  ;; Customize your Org-Roam-Bibtex settings here
  )
#+end_src

** Filing System
#+begin_src emacs-lisp
(require 'organizer)
#+end_src

* R setup
#+begin_src emacs-lisp 
(use-package ess
    :init (require 'ess-site)  ;; I don't know how else to get this working...
    :commands R
    :config
    (setq ess-default-style 'RStudio-))
#+end_src

* wORG Microsome
** Org Beautification
#+begin_src emacs-lisp
(setq org-startup-indented t
        org-pretty-entities t
        org-hide-emphasis-markers t
        org-startup-with-inline-images t)
#+end_src

** Sticky Headers
#+begin_src emacs-lisp
(use-package org-sticky-header
    :elpaca (org-sticky-header :host github :repo "alphapapa/org-sticky-header")
    :after (org)
  :ensure t
  :after org
  :hook (org-mode . org-sticky-header-mode)
  :config
  (setq org-sticky-header-full-path 'full)
  (setq org-sticky-header-outline-path-separator " ❱ ")
  (setq org-sticky-header-face-list
        '((header-line . (:inherit mode-line :background "gray90" :foreground "black" :box nil)))))
#+end_src

** ORG-REMARK
#+begin_src emacs-lisp
  (use-package org-remark
    :bind (;; :bind keyword also implicitly defers org-remark itself.
           ;; Keybindings before :map is set for global-map.
           ("C-c n m" . org-remark-mark)
           ("C-c n l" . org-remark-mark-line)
           :map org-remark-mode-map
           ("C-c n o" . org-remark-open)
           ("C-c n ]" . org-remark-view-next)
           ("C-c n [" . org-remark-view-prev)
           ("C-c n r" . org-remark-remove)
           ("C-c n d" . org-remark-delete))
    ;; Alternative way to enable `org-remark-global-tracking-mode' in
    ;; `after-init-hook'.
    ;; :hook (after-init . org-remark-global-tracking-mode)
    :init
    ;; It is recommended that `org-remark-global-tracking-mode' be
    ;; enabled when Emacs initializes. Alternatively, you can put it to
    ;; `after-init-hook' as in the comment above
    (org-remark-global-tracking-mode +1)
    :config
    (use-package org-remark-info :after info :config (org-remark-info-mode +1))
    (use-package org-remark-eww  :after eww  :config (org-remark-eww-mode +1))
    (use-package org-remark-nov  :after nov  :config (org-remark-nov-mode +1)))

#+end_src

** ORG-TEMPO | SHORT HAND
#+begin_src emacs-lisp
(require 'org-tempo)
(add-to-list 'org-structure-template-alist '("sh" . "src shell"))
(add-to-list 'org-structure-template-alist '("el" . "src emacs-lisp"))
(add-to-list 'org-structure-template-alist '("py" . "src python"))
#+end_src
*** ORG-mediverse
#+begin_src emacs-lisp
(define-abbrev global-abbrev-table "<m" "* Thyroid\n** Embryology\n** Anatomy** Physiology Functions\n** Pathology** Clinical Parameters to look out for\n** Pharmacology")
(setq-default abbrev-mode t)
#+end_src

** Directory (Yellow Pages)
#+begin_src emacs-lisp
  (setq org-directory "~/Documents/wORG/Colloquy")
  (setq org-journal-dir "~/Documents/wORG/MyPersonal/My-Microsome")
  (setq org-roam-directory "~/Documents/wORG/Org-ROAM/Alexandria")
#+end_src

** IDEA Org-Sidebar
#+begin_src emacs-lisp :tangle no
  (use-package org-ol-tree
    :elpaca (org-ol-tree :host github :repo "Townk/org-ol-tree"))
#+end_src
