README.org
** Super bullets
#+begin_src emacs-lisp
    (use-package org-superstar
    :config
  (add-hook 'org-mode-hook (lambda () (org-superstar-mode 1))))
  (setq
	     ;; Edit settings
	     org-auto-align-tags nil
	     org-tags-column 0
	     org-catch-invisible-edits 'show-and-error
	     org-special-ctrl-a/e t
	     org-insert-heading-respect-content t

	     ;; Org styling, hide markup etc.
	     org-hide-emphasis-markers t
	     org-pretty-entities t
	     org-ellipsis "…"

	     ;; Agenda styling
	     org-agenda-tags-column 0
	     org-agenda-block-separator ?─
	     org-agenda-time-grid
	     '((daily today require-timed)
	       (800 1000 1200 1400 1600 1800 2000)
	       " ┄┄┄┄┄ " "┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄")
	     org-agenda-current-time-string
	     "⭠ now ─────────────────────────────────────────────────")
#+end_src

** ENABLING OF TOC TO ALL ORG DOCUMENTS:
#+begin_src emacs-lisp
(use-package toc-org
    :commands toc-org-enable
    :init (add-hook 'org-mode-hook 'toc-org-enable))
#+end_src

** Olivetti
#+begin_src emacs-lisp
        (use-package olivetti
          :ensure t
          :hook
          (org-mode . olivetti-mode)
          :config
          (olivetti-set-width 160)
  )
#+end_src

** Interleaving
In the past, textbooks were sometimes published as interleaved editions. That meant, each page was followed by a blank page and ambitious students/scholars had the ability to take their notes directly in their copy of the textbook.
#+begin_src emacs-lisp :tangle no
(use-package org-noter
  :config
  ;; Your org-noter config ........
  (require 'org-noter-pdftools))

(use-package org-pdftools
  :hook (org-mode . org-pdftools-setup-link))

(use-package org-noter-pdftools
  :after org-noter
  :config
  ;; Add a function to ensure precise note is inserted
  (defun org-noter-pdftools-insert-precise-note (&optional toggle-no-questions)
    (interactive "P")
    (org-noter--with-valid-session
     (let ((org-noter-insert-note-no-questions (if toggle-no-questions
                                                   (not org-noter-insert-note-no-questions)
                                                 org-noter-insert-note-no-questions))
           (org-pdftools-use-isearch-link t)
           (org-pdftools-use-freepointer-annot t))
       (org-noter-insert-note (org-noter--get-precise-info)))))

  ;; fix https://github.com/weirdNox/org-noter/pull/93/commits/f8349ae7575e599f375de1be6be2d0d5de4e6cbf
  (defun org-noter-set-start-location (&optional arg)
    "When opening a session with this document, go to the current location.
With a prefix ARG, remove start location."
    (interactive "P")
    (org-noter--with-valid-session
     (let ((inhibit-read-only t)
           (ast (org-noter--parse-root))
           (location (org-noter--doc-approx-location (when (called-interactively-p 'any) 'interactive))))
       (with-current-buffer (org-noter--session-notes-buffer session)
         (org-with-wide-buffer
          (goto-char (org-element-property :begin ast))
          (if arg
              (org-entry-delete nil org-noter-property-note-location)
            (org-entry-put nil org-noter-property-note-location
                           (org-noter--pretty-print-location location))))))))
  (with-eval-after-load 'pdf-annot
    (add-hook 'pdf-annot-activate-handler-functions #'org-noter-pdftools-jump-to-note)))
#+end_src

*** Dependency
#+begin_src emacs-lisp
(use-package pdf-tools)
#+end_src

#+RESULTS:

** ORG-Presentation
#+begin_src emacs-lisp
         (use-package org-present
           :ensure t
           :config
           (setq org-present-text-scale 3
                 org-present-mode-hook
                 (lambda ()
                   (org-present-big)
                   (org-display-inline-images)
                   (org-present-hide-cursor)
                   (org-present-read-only))))
#+end_src

** TEMPLATES
*** Org-journal
#+begin_src emacs-lisp
(setq  org-journal-date-prefix "#+TITLE:"
       org-journal-time-prefix "*  "
       org-journal-date-format "%A, %F"
       org-journal-file-format "%F.org")
#+end_src
*** Org-Roam
#+begin_src emacs-lisp
          ;; Org-roam Template ---------------------------------------------------------------------------------------------------
  ;;       (setq org-roam-capture-templates
  ;;             `(("d" "default" plain "%?"
  ;;                 :target (file+head "${slug}.org" "#+title: ${title}")
  ;;                 :unnarrowed t)))
  (setq org-roam-capture-templates
        `(("d" "Default" plain "%?"
           :target (file+head "${slug}.org" "#+title: ${title}\n#+created: %u\n#+last_modified: %U\n#+ROAM_TAGS: ${tag}")
           :unnarrowed t)
          ("r" "Roam Note" plain "%?"
           :target (file+head "${slug}.org" "#+title: ${title}\n#+created: %u\n#+last_modified: %U\n#+ROAM_TAGS: ${tag}\n\n* Thing that I have understood\n\n* Thing that I have 50-50% Confidence\n\n* Thing that I blew past my head and need to review\n\n* Research Article\n\n* Devil's Advocate Corner\n\n")
           :unnarrowed t)))

#+end_src

#+RESULTS:
| d | Default | plain | %? | :target | (file+head ${slug}.org #+title: ${title} |

* ORG-ROAM
** Installation
#+begin_src emacs-lisp 
          (use-package org-roam
            :elpaca (org-roam :host github :repo "org-roam/org-roam"
                       :files (:defaults "extensions/*") )
            :init
          (setq org-roam-v2-ack t)
         (org-roam-db-autosync-mode)
         (require 'org-roam-protocol)
         :config
  (setq org-id-location "~/Documents/wORG/Org-ROAM/Alexandria" )
        (setq org-fold-catch-invisible-edits t)
  )
#+end_src
** IDEA EMACS-sql
#+begin_src emacs-lisp
 ; (setq org-roam-db-location "~/Documents/wORG/Org-ROAM/Alexandria")
#+end_src
** ORG-ROAM-UI
#+begin_src emacs-lisp
(use-package org-roam-ui
:after (org-roam)
    :elpaca
    (roam-ui :host github :repo "org-roam/org-roam-ui" :branch "main" :files ("*.el" "out"))
;;         normally we'd recommend hooking orui after org-roam, but since org-roam does not have
;;         a hookable mode anymore, you're advised to pick something yourself
;;         if you don't care about startup time, use
;;  :hook (after-init . org-roam-ui-mode)
    :config
    (setq org-roam-ui-sync-theme t
            org-roam-ui-follow t
            org-roam-ui-update-on-save t
            org-roam-ui-open-on-start t))

#+end_src

** Caching
#+begin_src emacs-lisp
(setq org-roam-db-node-include-function
      (lambda ()
        (not (member "ATTACH" (org-get-tags)))))

#+end_src

* PLAN ORG-AGENDA :FixMe:
** KEYWORDS
#+begin_src emacs-lisp
(setq org-todo-keywords '((sequence "IDEA(i)" "PLAN(p)" "|" "TODO(t)" "In-Progress(r)" "|" "DONE(d)" "CANCELLED(c)" "|" "DEFERRED(f)")))
#+end_src
*** AGENDA KEYWORD FACES 
#+begin_src emacs-lisp
;; TODO: org-todo-keyword-faces
(setq org-todo-keyword-faces
      '(("IDEA" . (:foreground "DeepSkyBlue2" :weight bold))
        ("PLAN" . (:foreground "orange red" :weight bold))
        ("TODO" . (:foreground "HotPink2" :weight bold))
        ("In-Progress" . (:foreground "MediumPurple3" :weight bold))
        ("DONE" . (:foreground "LimeGreen" :weight bold))
        ("CANCELLED" . (:foreground "red3" :weight bold))
        ("DEFERRED" . (:foreground "DarkOrange2" :weight bold))))

#+end_src
** ORG-REOCCURER
For all the reoccuring tasks. [[https://github.com/mrcnski/org-recur/tree/master][more info]]
+ ==Examples:==
  - `|+2|`: Recur every other day.
  - `|+w|`: Recur every week.
  - `|1|`: Recur on the first of every month.
  - `|Thu|`: Recur every Thursday.
  - `|Sun,Sat|`: Recur every Sunday and Saturday.*
  - `|Wkdy|`: Recur every weekday.*
#+begin_src emacs-lisp
(use-package org-recur
  :demand t)
#+end_src

** RE: file 
#+begin_src emacs-lisp
;; Customize the variable org-refile-targets to specify the refile targets.
;; The example below sets it to refile headlines in the current buffer,
;; as well as in the "~/path/to/destination.org" file.
(setq org-refile-targets '((nil :maxlevel . 3)
                           (org-agenda-files :maxlevel . 3)
                           ("~/Documents/wORG/My-Personal/Transmogrify/Niflheim.org" :maxlevel . 3)))

;; Optionally, set org-refile-use-outline-path to t to show the full outline path in the completion.
(setq org-refile-use-outline-path t)

;; Optionally, set org-outline-path-complete-in-steps to t for better completion.
(setq org-outline-path-complete-in-steps t)

;; Optionally, set org-refile-allow-creating-parent-nodes to t to allow creating non-existing parent nodes.
(setq org-refile-allow-creating-parent-nodes 'confirm)
#+end_src

** UI Improvement 
*** Oragami
#+begin_src emacs-lisp :tangle no
  (use-package origami
    :config
    (defvar ap/org-super-agenda-auto-show-groups
      '("Schedule" "Bills" "Priority A items" "Priority B items"))
    (defun ap/org-super-agenda-origami-fold-default ()
      "Fold certain groups by default in Org Super Agenda buffer."
      (forward-line 3)
      (cl-loop do (origami-forward-toggle-node (current-buffer) (point))
               while (origami-forward-fold-same-level (current-buffer) (point)))
      (--each ap/org-super-agenda-auto-show-groups
        (goto-char (point-min))
        (when (re-search-forward (rx-to-string `(seq bol " " ,it)) nil t)
          (origami-show-node (current-buffer) (point)))))

    :hook ((org-agenda-mode . origami-mode)
           (org-agenda-finalize . ap/org-super-agenda-origami-fold-default)))
#+end_src

#+begin_src emacs-lisp
(use-package origami
    :ensure t
    :config
    (global-origami-mode))

#+end_src
*** Org-heatmaps
#+begin_src emacs-lisp
      (use-package org-heatmap
      :elpaca (org-heatmap :host github :repo "Elilif/org-heatmap")
    :config
  (add-hook 'org-mode-hook #'org-heatmap-mode))
#+end_src
