init.el

(use-package org-superstar
  :config
(add-hook 'org-mode-hook (lambda () (org-superstar-mode 1))))
(setq
	   ;; Edit settings
	   org-auto-align-tags nil
	   org-tags-column 0
	   org-catch-invisible-edits 'show-and-error
	   org-special-ctrl-a/e t
	   org-insert-heading-respect-content t

	   ;; Org styling, hide markup etc.
	   org-hide-emphasis-markers t
	   org-pretty-entities t
	   org-ellipsis "…"

	   ;; Agenda styling
	   org-agenda-tags-column 0
	   org-agenda-block-separator ?─
	   org-agenda-time-grid
	   '((daily today require-timed)
	     (800 1000 1200 1400 1600 1800 2000)
	     " ┄┄┄┄┄ " "┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄")
	   org-agenda-current-time-string
	   "⭠ now ─────────────────────────────────────────────────")

(use-package toc-org
    :commands toc-org-enable
    :init (add-hook 'org-mode-hook 'toc-org-enable))

(use-package olivetti
        :ensure t
        :hook
        (org-mode . olivetti-mode)
        :config
        (olivetti-set-width 160)
)

(use-package pdf-tools)

(use-package org-present
  :ensure t
  :config
  (setq org-present-text-scale 3
        org-present-mode-hook
        (lambda ()
          (org-present-big)
          (org-display-inline-images)
          (org-present-hide-cursor)
          (org-present-read-only))))

(setq  org-journal-date-prefix "#+TITLE:"
       org-journal-time-prefix "*  "
       org-journal-date-format "%A, %F"
       org-journal-file-format "%F.org")

;; Org-roam Template ---------------------------------------------------------------------------------------------------
;;       (setq org-roam-capture-templates
;;             `(("d" "default" plain "%?"
;;                 :target (file+head "${slug}.org" "#+title: ${title}")
;;                 :unnarrowed t)))
(setq org-roam-capture-templates
      `(("d" "Default" plain "%?"
         :target (file+head "${slug}.org" "#+title: ${title}\n#+created: %u\n#+last_modified: %U\n#+ROAM_TAGS: ${tag}")
         :unnarrowed t)
        ("r" "Roam Note" plain "%?"
         :target (file+head "${slug}.org" "#+title: ${title}\n#+created: %u\n#+last_modified: %U\n#+ROAM_TAGS: ${tag}\n\n* Thing that I have understood\n\n* Thing that I have 50-50% Confidence\n\n* Thing that I blew past my head and need to review\n\n* Research Article\n\n* Devil's Advocate Corner\n\n")
         :unnarrowed t)))

(use-package org-roam
          :elpaca (org-roam :host github :repo "org-roam/org-roam"
                     :files (:defaults "extensions/*") )
          :init
        (setq org-roam-v2-ack t)
       (org-roam-db-autosync-mode)
       (require 'org-roam-protocol)
       :config
(setq org-id-location "~/Documents/wORG/Org-ROAM/Alexandria" )
      (setq org-fold-catch-invisible-edits t)
)

; (setq org-roam-db-location "~/Documents/wORG/Org-ROAM/Alexandria")

(use-package org-roam-ui
:after (org-roam)
    :elpaca
    (roam-ui :host github :repo "org-roam/org-roam-ui" :branch "main" :files ("*.el" "out"))
;;         normally we'd recommend hooking orui after org-roam, but since org-roam does not have
;;         a hookable mode anymore, you're advised to pick something yourself
;;         if you don't care about startup time, use
;;  :hook (after-init . org-roam-ui-mode)
    :config
    (setq org-roam-ui-sync-theme t
            org-roam-ui-follow t
            org-roam-ui-update-on-save t
            org-roam-ui-open-on-start t))

(setq org-roam-db-node-include-function
      (lambda ()
        (not (member "ATTACH" (org-get-tags)))))

(setq org-todo-keywords '((sequence "IDEA(i)" "PLAN(p)" "|" "TODO(t)" "In-Progress(r)" "|" "DONE(d)" "CANCELLED(c)" "|" "DEFERRED(f)")))

;; TODO: org-todo-keyword-faces
(setq org-todo-keyword-faces
      '(("IDEA" . (:foreground "DeepSkyBlue2" :weight bold))
        ("PLAN" . (:foreground "orange red" :weight bold))
        ("TODO" . (:foreground "HotPink2" :weight bold))
        ("In-Progress" . (:foreground "MediumPurple3" :weight bold))
        ("DONE" . (:foreground "LimeGreen" :weight bold))
        ("CANCELLED" . (:foreground "red3" :weight bold))
        ("DEFERRED" . (:foreground "DarkOrange2" :weight bold))))

(use-package org-recur
  :demand t)

;; Customize the variable org-refile-targets to specify the refile targets.
;; The example below sets it to refile headlines in the current buffer,
;; as well as in the "~/path/to/destination.org" file.
(setq org-refile-targets '((nil :maxlevel . 3)
                           (org-agenda-files :maxlevel . 3)
                           ("~/Documents/wORG/My-Personal/Transmogrify/Niflheim.org" :maxlevel . 3)))

;; Optionally, set org-refile-use-outline-path to t to show the full outline path in the completion.
(setq org-refile-use-outline-path t)

;; Optionally, set org-outline-path-complete-in-steps to t for better completion.
(setq org-outline-path-complete-in-steps t)

;; Optionally, set org-refile-allow-creating-parent-nodes to t to allow creating non-existing parent nodes.
(setq org-refile-allow-creating-parent-nodes 'confirm)

(use-package origami
    :ensure t
    :config
    (global-origami-mode))

(use-package org-heatmap
    :elpaca (org-heatmap :host github :repo "Elilif/org-heatmap")
  :config
(add-hook 'org-mode-hook #'org-heatmap-mode))
