README.org
*** Org-priorities
- Chat gpt told me to do in=t this manner so here we go:
  #+begin_src emacs-lisp
    (setq org-highest-priority ?A       ; Highest priority is 'A'
          org-lowest-priority ?D        ; Lowest priority is 'D'
          org-default-priority ?C)      ; Default priority is 'C'

    (setq org-priority-faces
          '((?A . (:foreground "red" :weight bold :height 1.2))    ; Highest priority: ❗
            (?B . (:foreground "orange" :weight bold :height 1.2)) ; Priority 'B': ⬆
            (?C . (:foreground "yellow" :weight bold :height 1.2)) ; Priority 'C': ⬇
            (?D . (:foreground "green" :weight bold :height 1.2))) ; Lowest priority: ☕
            )

  #+end_src  
*** IDEA Org-Fancy-Priorities-List
#+begin_src emacs-lisp 
      (use-package org-fancy-priorities
	:ensure t
	:hook (org-mode . org-fancy-priorities-mode))

   (setq org-fancy-priorities-list '((?A . "❗")
					   (?B . "⬆")
					   (?C . "⬇")
					   (?D . "☕")))
#+end_src
** ORG-CalDAv
#+begin_src emacs-lisp
(setq org-caldav-url "https://cloud.disroot.org/remote.php/dav/calendars/xanaus")
(setq org-caldav-calendar-id "transmogrify")
(setq org-caldav-inbox "~/Documents/wORG/My-Personal/Transmogrify/Sync.org")
(setq org-caldav-backup-file "~/Documents/My-Personal/Transmogrify/Niflheiem.org")
(setq org-icalendar-timezone "IST")
(setq org-caldav-files '("~/Documents/wORG/My-Personal/Transmogrify/Hammurabi's-Code.org""~/Documents/wORG/My-Personal/Transmogrify/Stone-Tablet.org"))
(setq org-icalendar-include-todo 'all
    org-caldav-sync-todo t)
#+end_src

* ORG-JOURNAL
#+begin_src emacs-lisp
            (use-package org-journal
              :config
              (setq org-journal-dir "~/Documents/wORG/My-Personal/My-Microsome"))
#+end_src
* IDEA RSS
#+begin_src emacs-lisp
              (use-package elfeed
                :ensure t)

        (use-package elfeed-score
          :ensure t
          :config
          (elfeed-score-enable))
       ; (require 'zotearo)
#+end_src
* Vterm
#+begin_src emacs-lisp
  (use-package eat
 :elpaca (eat 
       :host codeberg
       :repo "akib/emacs-eat"
       :files ("*.el" ("term" "term/*.el") "*.texi"
               "*.ti" ("terminfo/e" "terminfo/e/*")
               ("terminfo/65" "terminfo/65/*")
               ("integration" "integration/*")
               (:exclude ".dir-locals.el" "*-tests.el"))))
#+end_src

#+RESULTS:

* Custom Configuration
#+begin_src emacs-lisp
  (setq custom-file "~/.config/emacs/custom.el")
  (when (file-exists-p custom-file)
    (load custom-file))
;; Local Variables:
;; no-byte-compile: t
;; End:
#+end_src

