init.el

(setq org-highest-priority ?A       ; Highest priority is 'A'
      org-lowest-priority ?D        ; Lowest priority is 'D'
      org-default-priority ?C)      ; Default priority is 'C'

(setq org-priority-faces
      '((?A . (:foreground "red" :weight bold :height 1.2))    ; Highest priority: ❗
        (?B . (:foreground "orange" :weight bold :height 1.2)) ; Priority 'B': ⬆
        (?C . (:foreground "yellow" :weight bold :height 1.2)) ; Priority 'C': ⬇
        (?D . (:foreground "green" :weight bold :height 1.2))) ; Lowest priority: ☕
        )

(use-package org-fancy-priorities
     :ensure t
     :hook (org-mode . org-fancy-priorities-mode))

(setq org-fancy-priorities-list '((?A . "❗")
					(?B . "⬆")
					(?C . "⬇")
					(?D . "☕")))

(setq org-caldav-url "https://cloud.disroot.org/remote.php/dav/calendars/xanaus")
(setq org-caldav-calendar-id "transmogrify")
(setq org-caldav-inbox "~/Documents/wORG/My-Personal/Transmogrify/Sync.org")
(setq org-caldav-backup-file "~/Documents/My-Personal/Transmogrify/Niflheiem.org")
(setq org-icalendar-timezone "IST")
(setq org-caldav-files '("~/Documents/wORG/My-Personal/Transmogrify/Hammurabi's-Code.org""~/Documents/wORG/My-Personal/Transmogrify/Stone-Tablet.org"))
(setq org-icalendar-include-todo 'all
    org-caldav-sync-todo t)

(use-package org-journal
  :config
  (setq org-journal-dir "~/Documents/wORG/My-Personal/My-Microsome"))

(use-package elfeed
         :ensure t)

 (use-package elfeed-score
   :ensure t
   :config
   (elfeed-score-enable))
; (require 'zotearo)

(use-package eat
:elpaca (eat 
      :host codeberg
      :repo "akib/emacs-eat"
      :files ("*.el" ("term" "term/*.el") "*.texi"
              "*.ti" ("terminfo/e" "terminfo/e/*")
              ("terminfo/65" "terminfo/65/*")
              ("integration" "integration/*")
              (:exclude ".dir-locals.el" "*-tests.el"))))

(setq custom-file "~/.config/emacs/custom.el")
  (when (file-exists-p custom-file)
    (load custom-file))
;; Local Variables:
;; no-byte-compile: t
;; End:
